m = 0
while m < 1:
key = {'a': 'n', 'b': 'o', 'c': 'p', 'd': 'q', 'e': 'r', 'f': 's', 'g': 't', 'h': 'u',
        'i': 'v', 'j': 'w', 'k': 'x', 'l': 'y', 'm': 'z', 'n': 'a', 'o': 'b', 'p': 'c',
        'q': 'd', 'r': 'e', 's': 'f', 't': 'g', 'u': 'h', 'v': 'i', 'w': 'j', 'x': 'k',
        'y': 'l', 'z': 'm', 'A': 'N', 'B': 'O', 'C': 'P', 'D': 'Q', 'E': 'R', 'F': 'S',
        'G': 'T', 'H': 'U', 'I': 'V', 'J': 'W', 'K': 'X', 'L': 'Y', 'M': 'Z', 'N': 'A',
        'O': 'B', 'P': 'C', 'Q': 'D', 'R': 'E', 'S': 'F', 'T': 'G', 'U': 'H', 'V': 'I',
        'W': 'J', 'X': 'K', 'Y': 'L', 'Z': 'M', ' ': ' ', '?': '/', '!': '@', '#': '$',
        ':': ';', '/': '?', '@': '!', '$': '#', ';': ':', 
         'ă':'1', 'â':'3', 'ê':'5', 'ô':'7', 'ơ':'9', 'ư':'Ư',
       '1':'ă','3':'â','5':'ê', '7':'ô', '0':'ơ','Ư':'ư',
        
'Ă':'2', 'Â':'4', 'Ê':'6', 'Ô':'8', 'Ơ':'0', 'Ư':'ư',
'2':'Ă', '4':'Â', '6':'Ê', '8':'Ô', '0':'Ơ', 'ư':'Ư',
'ằ': 'ự', 'ầ': 'ợ', 'ề': 'ộ', 'ồ': 'ệ', 'ờ': 'ậ', 'ù': 'ặ', 'ẳ': 'ữ', 'ẩ': 'ỡ', 'ể': 'ỗ', 'ổ': 'ễ', 'ở': 'ẫ', 'ử': 'ẵ', 'ắ': 'ú', 'ấ': 'ớ', 'ế': 'ố', 'ố': 'ế', 'ớ': 'ấ', 'ú': 'ắ', 'ẵ': 'ử', 'ẫ': 'ở', 'ễ': 'ổ', 'ỗ': 'ể', 'ỡ': 'ẩ', 'ữ': 'ẳ', 'ặ': 'ù', 'ậ': 'ờ', 'ệ': 'ồ', 'ộ': 'ề', 'ợ': 'ầ', 'ự': 'ằ',

'Ằ': 'Ự', 'Ầ': 'Ợ', 'Ề': 'Ộ', 'Ồ': 'Ệ', 'Ờ': 'Ậ', 'Ù': 'Ặ', 'Ẳ': 'Ữ', 'Ẩ': 'Ỡ', 'Ể': 'Ỗ', 'Ổ': 'Ễ', 'Ở': 'Ẫ', 'Ử': 'Ẵ', 'Ắ': 'Ú', 'Ấ': 'Ớ', 'Ế': 'Ố', 'Ố': 'Ế', 'Ớ': 'Ấ', 'Ú': 'Ắ', 'Ẵ': 'Ử', 'Ẫ': 'Ở', 'Ễ': 'Ổ', 'Ỗ': 'Ể', 'Ỡ': 'Ẩ', 'Ữ': 'Ẳ', 'Ặ': 'Ù', 'Ậ': 'Ờ', 'Ệ': 'Ồ', 'Ộ': 'Ề', 'Ợ': 'Ầ', 'Ự': 'Ằ'
        }
    sentence = input('\nType the sentence: ')

    password = []

    for i in range(len(sentence)):
        while True:
            try:
                x = key[sentence[i]]
                password.append(x)
                break
            except KeyError:
                print('Type again!')
                break
                break
    print('result: ',''.join(str(e) for e in password))
    continue

